export const svictor = [
    "Та как ты воще посмел\n",
    "Вот ответь мне КАК?!?!",
    "Как можно нарушыть все 6 функциональных грехов!?!",
    "При чем в 1 приложении и по несколько раз?!?!",
    "Ой все, видеть тебя не хочу...",
    "Такие как ты, жалкие ООПешники, никогда не смогут пройти через функционилище",
    "И обречены на вечное функционирование в функциональном аду",
    "Так что устраюйся поудобнее...",
    "У нас тут есть функции, монады, функторы, замыкания, отсутствие побочных еффектов",
    "И куча других функциональных прелестей",
    "http://www.dbnet.ece.ntua.gr/~adamo/languages/books/p359-hudak.pdf",
    "Прочитаешь, потом поговорим"
];

