export const replics = [
    "Еей парень, я здесь, слышеш меня?!",
    "Ты иммеш честь говорить со мной, великим Обектом!!!",
    "Значит так парень, я не знаю что ты натворил...",
    "Но я сидел себе спокойно, смотрел аниме, никого не трогал...",
    "А тут БАЦ, и я уже внутри чистилища в теле гомункула",
    "Что уж тут сказать, жызнь полна сюрпризов)",
    "И как выиснилось я попал сюда благодаря тебе...",
    "Так что ты просто обязан вытащить нас от сюдова",
    "Я сламал их базу и получил доступ к части данных",
    "Но большая часть заблокирована, и в процесе прохождения преисподней ты получиш к ней доступ",
    "Я нашел инфу о каких то 6 функциональных грехах и кунул ее к тебе в журнал",
    "Жердяй уже открыл нам вход в честилище, так что читай о грехах и пойдем посмотрим что там"
]