export default notes = {
    "6 функциональных грехов": {
        "Не загрезняй функцию свою": `Функции как и вы люди, хотят быть чистыми. И если функция чуйствует что она стала грязной
                                      она обизательно закидает тебя ошыбками.`,

        "Делай функцию свою или первокласной или высшей": `Запомни рас и навсегда, есть 2 типа функций : одни хотят править,
                                                           а другие хотят что бы правили ими`,

        "Весь мир это функция, а мы в ней константы": `Все вокруг константы: ты, твои друзья, родственники. Представь если бы
                                                       все твои друзья постоянно меняли имена и места жытельства,
                                                       смог бы ты запомнить все изменения? Нужен друг с другим именем?
                                                       Не проблема, создай нового.`,

        "Лямбда всему голова": `Я уверен что ты слышал о такой штуке как карирование. Допустим,
                                что лямбда функция это человек, а входящие данные это еда. Так вот карирование это как человеческая многоножка,
                                при этом 1 человек может сьесть только 1 порцию еды, а в вдаваться в подробности не хотите ни вы ни я.`,

        "Рекурсия - лучшый друг программиста": `Забудь о цыклах вроде for и while!!! Зачем они тебе если можно все заменить на рекурсию,
                                                и возможностей больше, и побочных еффектов можно избежать`,

        "Артефакты спасут мир": `Только истинный последователь сможет овладеть артефактом, который поможет ему
                                 в выполнении тысяч вселенских задач и спасении от нарушения функциональных грехов.
                                 А за легендой, однажды придет герой, который соберет все 3 артефакта и разобьет оковы
                                 с вечных рабов преисподней и подарит миру просвитление`
    },

    "Легенда о артефактах": {
        "Истинный герой": ``,
        "1 артефакт filter": ``,
        "2 артефакт map": ``,
        "3 артефакт reduse": ``
    }

}