import React from 'react';

export const notes = [[
    {
        title: "Добро пожаловать, герой",
        text: [
            {
                title: "Пролог",
                text: `Мир ооп - грязный и жестокий. Напротив же, мир функционального программирования предлагает 
                тебе невыданные ранее возможности.
                Этот, на скорую руку сделаный, квест поможет освоить тебе функциональное программирование. 
                Тебе предстоит спасти жителей этого мира от грязных лап демона, поработившего нагрешивших оопешников.
                место действий - "функционилище" - последнее пристанище оопешников. Прошу проходить, для тебя мы подготовили
                особый котел. Вахахах!!!`
            },
            {
                title: "В огне",
                text: `Открыв глаза, ты увидел яркий свет.
                    Где я? 
                    "Ооо, Еще один! Чтож, добро пожаловать." - раздался позади голос.
                    "Посмотрим, что ты умеешь!"
                    Но сначала прошу ознакомиться с обучением:`
            },
            {
                title: "Левая панель",
                text: "На левой панели находится список квестов и переключатели между журналом и редактором кода. Ты можешь свободно переключаться между квестами и режимами."
            },
            {
                title: "Правая часть страницы",
                text: "В основном части страницы находится редактор кода с терминалом и этот журнал с дополнительной информацией."
            },
            {
                title: "Редактор кода и квесты",
                text: "Чтобы запустить квест, нажми на его название. В редакторе кода можно выполнять задания. Чтобы запустить свой код, нажми кнопку 'Run code'. В терминале под редактором кода можно будет увидеть результат запущеного кода. Если задание выполнено правильно, разблокируется следующий квест."
            },
            {
                title: "Чат",
                text: "В чате к тебе будут обращаться сюжетные персонажи. Также ты можешь запросить здесь подсказку. В режиме журнала чат недоступен."
            },
            {
                title: "Журнал",
                text: "Если будет нужна помощь, заглядывай в журнал. Здесь ты сможешь найти различные руководства."
            },
        ]
    },
    {
        title: "Назойливый незнакомец",
        text: [
            {
                title: "Просьба",
                text: `А ты не промах! Эх... Возможно ты сможешь мне помочь! Чертов демон не дает нам жить, поэтому мы собираем армию.
             Но вот проблема, мне поручили отобрать воинов среди мужчин, и это, черт побери, сложно! `,
            },
        ]
    },
    {
        title: "Обучение 2",
        text: [
            {
                title: "",
                text: `Неплохо-неплохо! А ты способный малый. Но все же, лучше почитай это`,
            },
            {
                title: "Чистая функция",
                text: `Чистой называют функцию которая является детерминированой и не имеет побочных еффектов.
            https://github.com/MostlyAdequate/mostly-adequate-guide-ru/blob/master/ch3-ru.md
            ...ЕЩЕ ТУТОРИАЛ...`,
            },
            {
                title: "Побочные еффекты?",
                text: `Побочными эффектами функции называют взаимодействие функции с окружающим миром. 
            Функция без побочных эффектов может обращаться и менять данные только внутри себя.`,
            }
        ]
    },
    {
        title: "Здравствуй, новая жизнь!",
        text: [
            {
                title: "",
                text: `В комнату входят индусы. Их поток не останавливаеться. Ты чувствуешь себя не ловко.`,
            },
            {
                title: "",
                text: `"Вау, да ты крут! Братик, может как-нибудь поможешь мне?"`,
            },
            {
                title: "",
                text: `Мастер: "Броня - это хорошо, но чем мы будем сражаться? О, я знаю, вот тебе палка, экипируй моих братков"`,
            },
        ]
    },
    {
        title: "Герой",
        text: [
            {
                title: "Истинный герой",
                text: `Однажды появиться в аду один человек, который будет отличаться от обычних обитателей преисподней.
             Будет он благороден, миролюбив и невероятно талантлив. Он сразу не понравиться Mephisto, ведь такие гости как он тут редкость.
             Очутиться он в типичной индуской деревушке где поможет жытелям с их проблемами. Станет он там своим, настоящей звездой в деревне.
             Очень герою будут по душе индусы, и будет у него 1 лучшый друг, с которым у них будет бизнес.
             Но прослишыт Mephisto про сей райский уголок, и отправить демонов разрушыть деревню. Демоны будут трощить и трощить, но
             никого не убивать, как приказал Mephisto. Все бы та ничего, вот только в той розрухе, привалило лучшего друга героя... каменным крестом, который индусы построили в честь героя.
             Не потерпит герой такого обращения, начнет он готовиться к войне, против Mephisto...`,
            },
            {
                title: "1 артефакт filter",
                text: ``,
            },
            {
                title: "2 артефакт map",
                text: ``,
            },
            {
                title: "3 артефакт reduse",
                text: ``,
            }
        ]
    }

]
];